%三维无人机航迹优化

%% 地图值函数
function Value = MapValueFunction(x,y)
%地形常数
a = 1; b = 1; c = 1; d = 1; e = 1; f = 1; g = 1;
z = sin(y + a)+b*sin(x)+c*cos(d*(y^2 + x^2))+e*cos(y) + ...
            f*sin(f*(y^2+x^2))+g*cos(y);
%山峰模型
%% 山峰模型创建
A = [60,60;
    100,100;
    180,160;
    50,140;
    150,45;
    110,150;
    170,120]; % 山峰坐标点
h0 = 0; %山峰最低位置
hi = [50;60;80;70;65;54;50]; %山峰的高度
ai = [20;35;20;20;15;19;15]; %山峰的X方向坡度
bi = [20;35;20;20;15;19;15]; %山峰的Y方向坡度
h = sum(hi.*exp(-(x-A(:,1)).^2./ai.^2 - (y-A(:,2)).^2./bi.^2))+h0;
Value = max(z,h);

end